# -*- coding: utf-8 -*-

BOT_TOKEN = "308039515:AAFc2mU9mCYtyZS7zwXNYLNX0XFj0MWvLPY"

DATABASE_PATH = "db/database.db"

ABOUT_STR = '''
<b>Group Bot
Developed by</b> <b>CMC MSU
Beta v0.4</b>

<b>v0.4 Changelog:</b>
<i>Возможность создавать приватные группы.
Создатель группы перманентно становится старостой в этой группе.
Староста может менять название и пароль группы.</i>

<b>v0.3 Changelog:</b>
<i>Настроена работа бота через вебхук.</i>

<b>v0.2 Changelog:</b>
<i>Оповещения сгруппированы в один пункт меню.
Добавлено оповещение о перерыве.</i>

<b>Guide</b>
<i>Значок &gt; в меню обознает что у этого пункта есть подменю.</i>

Чтобы за вас могли расписаться можно загрузить фото и скриншот своей подписи в той же вкладке и отправлять её всем в нужный момент при помощи кнопки "Черкануть" во вкладке "Оповещения".

Сигналы всех оповещений можно включить/выключить в меню "Настройки"

По поводу загрузки расписания и обновления заметок все вопросы к создателю группы.
'''
